messages = {
    'kz': {
        'start': '👋 Сәлеметсiз бе! \nСіз Лидер Плюс тұтынушыларды қолдау бөліміне хабарластыңыз!',
        'choose_language': '🔤 Тілді таңдаңыз:',
        'thank_you': '🙏 Телефон нөміріңізді бөліскеніңіз үшін рақмет! \nАты-жөніңізді және қандай өтінішіңіз томенге жазыныз:',
        'loading': '⏳ Деректеріңіз жіберілуде...',
        'success': '😊 Рақмет, кері байланыс күтіңіз.',
        'join_link': '🔗 Жеке чатқа қосылу үшін, мына сілтемені басыңыз: {}',
        'error': '❌ Деректерді жіберу кезінде қате болды.',
        'request_contact': '📞 Өтініш, контакт ақпаратын бөлісіңіз.',
        'share_contact': '📞 Телефон нөмірімді бөлісейін',
    },
    'ru': {
        'start': '👋 Здравствуйте! \nВы обратились в отдел Заботы о клиентах Лидер Плюс!',
        'choose_language': '🔤 Выберите язык:',
        'thank_you': '🙏 Спасибо за то, что поделились своим номером телефона! \nНапишите, ваше имя и фамилию и какой запрос:',
        'loading': '⏳ Данные отправляются...',
        'success': '😊 Спасибо, ждите обратной связи.',
        'join_link': '🔗 Нажмите на эту ссылку, чтобы присоединиться к личному чату: {}',
        'error': '❌ Ошибка при отправке данных.',
        'request_contact': '📞 Пожалуйста, поделитесь вашей контактной информацией.',
        'share_contact': '📞 Поделитесь своим номером телефона',
    }
}